{"data":{"allContentfulAbout":{"nodes":[{"node_locale":"en-US","childContentfulAboutAboutTextNode":{"internal":{"content":"Musa Arquitectos is an architecture workshop based on the basic principles of pure and functional design. The office focuses on seeking elegant, creative and contemporary solutions to pragmatic problems, with which they seek to create projects that conceptualize the existing relationships between their own identity, culture, client's need and the environmental obstacles that arise every day. His interest ranges from commercial projects and residential spaces; even public and cultural; to create projects that show a specific resonance within the space that is designed. The team seeks to expand the conventional role of the architect, developing projects under strategic thinking conceived behind creative solutions.\n\nEach design is derived from the creative approach of the company and its analytical research to meet the needs of each client, always staying within the limits of its aesthetic design. Each client receives a project driven primarily by their needs. We are looking for a team that carries the intrinsic values ​​of good design, good finishes and attention to detail to satisfy the needs of customers and find the most sustainable solutions for all parties involved. Musa Arquitectos is made up of talents with knowledge of history, design and sustainability; always looking for the best references and skills in anyone belonging to his team. His motivation is not only based on architecture, but on the ability to bring good design and service to Panama City, from a new and pragmatic point of view, with strategic and aesthetic thoughts."}}},{"node_locale":"es","childContentfulAboutAboutTextNode":{"internal":{"content":"Musa Arquitectos es un taller de arquitectura basada en los principios básicos del diseño puro y funcional. La oficina se enfoca en buscar soluciones elegantes, creativas y contemporáneas a problemas pragmáticos, con el cual buscan crear proyectos que conceptualicen las relaciones existentes entre identidad propia, cultura, necesidad del cliente y los obstáculos ambientales que se presentan día a día. Su interés abarca desde proyectos comerciales y espacios residenciales; hasta públicos y culturales; para crear proyectos que muestren una resonancia específica dentro del espacio que está diseñado. El equipo busca la expansión del rol convencional de la figura del arquitecto, desarrollando proyectos bajo pensamientos estratégicos concebidos detrás de soluciones creativas.\n\nCada diseño se deriva del enfoque creativo de la empresa y de su investigación analítica para satisfacer las necesidades de cada cliente, permaneciendo siempre dentro de los límites de su diseño estético. Cada cliente recibe un proyecto impulsado fundamentalmente por sus necesidades. Se busca un equipo que lleve los valores intrínsecos de un buen diseño, buenos acabados y atención al detalle para satisfacer las necesidades de los clientes y encontrar las soluciones más sostenibles para todas las partes involucradas. Musa Arquitectos está conformado por talentos con conocimiento de historia, diseño y sostenibilidad; buscando siempre las mejores referencias y habilidades en cualquier persona perteneciente a su equipo. Su motivación no sólo se basa en arquitectura, sino en la habilidad de traer buen diseño y servicio a la Ciudad de Panamá, desde un punto de vista nuevo y pragmático, con pensamientos estratégicos y a la vez estéticos."}}}]}}}